#Использовать asserts
#Использовать ".."

&Тест
Процедура ТестДолжен_ПроверитьФиксациюПотребленияПамятиДляОдногоБуфераДвоичныхДанных() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьФиксациюПотребленияПамятиДляНесколькихБуферовДвоичныхДанных() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Буфер1 = Новый БуферДвоичныхДанных(Размер);
	Буфер2 = Новый БуферДвоичныхДанных(Размер);
	Буфер3 = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, 3 * Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьФиксациюПотребленияПамятиДляМассиваСтрок() Экспорт

	// Подготовка
	ОжидаемоеЗначениеВерсия1 = 122.9;
	ОжидаемоеЗначениеВерсия2 = 145;
	Погрешность = 1.01;
	МассивСтрок = Новый Массив;
	КоличествоЭлементов = 1000;
	Текст = "Привет";
	ВерсияСреды = ВерсияСреды();
	
	// Действие
	МониторПамяти = Новый МониторПамяти();
	МониторПамяти.Начать();

	Для Инд = 1 По КоличествоЭлементов Цикл
		МассивСтрок.Добавить(Текст);
	КонецЦикла;

	ВыделеноБайт = МониторПамяти.Завершить();

	// Утверждение
	Если ВерсияСреды = "1" Тогда
		Ожидаем.Что(ВыделеноБайт / КоличествоЭлементов).Между(ОжидаемоеЗначениеВерсия1, ОжидаемоеЗначениеВерсия1 * Погрешность);
	ИначеЕсли ВерсияСреды = "2" Тогда
		Ожидаем.Что(ВыделеноБайт / КоличествоЭлементов).Между(ОжидаемоеЗначениеВерсия2, ОжидаемоеЗначениеВерсия2 * Погрешность);
	Иначе
		ВызватьИсключение СтрШаблон("Весрия среды %1 не поддерживается", ВерсияСреды);
	КонецЕсли;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьРазмерКучи() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	
	НачальныйРазмер = МониторПамяти.РазмерКучи();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.РазмерКучи() - НачальныйРазмер; // Такой подоход только для тестирования

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВсегоВыделеноБайт() Экспорт

	// Подготовка
	Размер = 10 * 1024 * 1024;
	Погрешность = 1.01;

	// Действие
	МониторПамяти = Новый МониторПамяти();
	
	НачальныйРазмер = МониторПамяти.ВсегоВыделеноБайт();

	Буфер = Новый БуферДвоичныхДанных(Размер);

	ВыделеноБайт = МониторПамяти.ВсегоВыделеноБайт() - НачальныйРазмер;

	// Утверждение
	Ожидаем.Что(ВыделеноБайт).Между(Размер, Размер * Погрешность);

КонецПроцедуры

Функция ВерсияСреды()
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Возврат Лев(СистемнаяИнформация.Версия, 1);
КонецФункции